## Plan Result (1112: stg_aria - Terraform Plan Apply)




<pre><code>Plan: 94 to add, 0 to change, 0 to destroy.</code></pre>

* Create
  * azurerm_eventhub.aria_topic[&#34;00-aplfpa-ack&#34;]
  * azurerm_eventhub.aria_topic[&#34;00-aplfpa-dl&#34;]
  * azurerm_eventhub.aria_topic[&#34;00-aplfpa-pub&#34;]
  * azurerm_eventhub.aria_topic[&#34;00-aplfta-ack&#34;]
  * azurerm_eventhub.aria_topic[&#34;00-aplfta-dl&#34;]
  * azurerm_eventhub.aria_topic[&#34;00-aplfta-pub&#34;]
  * azurerm_eventhub.aria_topic[&#34;00-apluta-ack&#34;]
  * azurerm_eventhub.aria_topic[&#34;00-apluta-dl&#34;]
  * azurerm_eventhub.aria_topic[&#34;00-apluta-pub&#34;]
  * azurerm_eventhub.aria_topic[&#34;00-bl-ack&#34;]
  * azurerm_eventhub.aria_topic[&#34;00-bl-dl&#34;]
  * azurerm_eventhub.aria_topic[&#34;00-bl-pub&#34;]
  * azurerm_eventhub.aria_topic[&#34;00-joh-ack&#34;]
  * azurerm_eventhub.aria_topic[&#34;00-joh-dl&#34;]
  * azurerm_eventhub.aria_topic[&#34;00-joh-pub&#34;]
  * azurerm_eventhub.aria_topic[&#34;00-sbl-ack&#34;]
  * azurerm_eventhub.aria_topic[&#34;00-sbl-dl&#34;]
  * azurerm_eventhub.aria_topic[&#34;00-sbl-pub&#34;]
  * azurerm_eventhub.aria_topic[&#34;00-td-ack&#34;]
  * azurerm_eventhub.aria_topic[&#34;00-td-dl&#34;]
  * azurerm_eventhub.aria_topic[&#34;00-td-pub&#34;]
  * azurerm_eventhub_authorization_rule.aria_topic_sas[&#34;00-aplfpa-ack&#34;]
  * azurerm_eventhub_authorization_rule.aria_topic_sas[&#34;00-aplfpa-dl&#34;]
  * azurerm_eventhub_authorization_rule.aria_topic_sas[&#34;00-aplfpa-pub&#34;]
  * azurerm_eventhub_authorization_rule.aria_topic_sas[&#34;00-aplfta-ack&#34;]
  * azurerm_eventhub_authorization_rule.aria_topic_sas[&#34;00-aplfta-dl&#34;]
  * azurerm_eventhub_authorization_rule.aria_topic_sas[&#34;00-aplfta-pub&#34;]
  * azurerm_eventhub_authorization_rule.aria_topic_sas[&#34;00-apluta-ack&#34;]
  * azurerm_eventhub_authorization_rule.aria_topic_sas[&#34;00-apluta-dl&#34;]
  * azurerm_eventhub_authorization_rule.aria_topic_sas[&#34;00-apluta-pub&#34;]
  * azurerm_eventhub_authorization_rule.aria_topic_sas[&#34;00-bl-ack&#34;]
  * azurerm_eventhub_authorization_rule.aria_topic_sas[&#34;00-bl-dl&#34;]
  * azurerm_eventhub_authorization_rule.aria_topic_sas[&#34;00-bl-pub&#34;]
  * azurerm_eventhub_authorization_rule.aria_topic_sas[&#34;00-joh-ack&#34;]
  * azurerm_eventhub_authorization_rule.aria_topic_sas[&#34;00-joh-dl&#34;]
  * azurerm_eventhub_authorization_rule.aria_topic_sas[&#34;00-joh-pub&#34;]
  * azurerm_eventhub_authorization_rule.aria_topic_sas[&#34;00-sbl-ack&#34;]
  * azurerm_eventhub_authorization_rule.aria_topic_sas[&#34;00-sbl-dl&#34;]
  * azurerm_eventhub_authorization_rule.aria_topic_sas[&#34;00-sbl-pub&#34;]
  * azurerm_eventhub_authorization_rule.aria_topic_sas[&#34;00-td-ack&#34;]
  * azurerm_eventhub_authorization_rule.aria_topic_sas[&#34;00-td-dl&#34;]
  * azurerm_eventhub_authorization_rule.aria_topic_sas[&#34;00-td-pub&#34;]
  * azurerm_key_vault_secret.client_id[&#34;00&#34;]
  * azurerm_key_vault_secret.client_secret_copy[&#34;00&#34;]
  * azurerm_key_vault_secret.curated_sas_token[&#34;00&#34;]
  * azurerm_key_vault_secret.eh_root_key[&#34;00&#34;]
  * azurerm_key_vault_secret.env[&#34;00&#34;]
  * azurerm_key_vault_secret.eventhub_topic_secrets[&#34;00-aplfpa-ack&#34;]
  * azurerm_key_vault_secret.eventhub_topic_secrets[&#34;00-aplfpa-dl&#34;]
  * azurerm_key_vault_secret.eventhub_topic_secrets[&#34;00-aplfpa-pub&#34;]
  * azurerm_key_vault_secret.eventhub_topic_secrets[&#34;00-aplfta-ack&#34;]
  * azurerm_key_vault_secret.eventhub_topic_secrets[&#34;00-aplfta-dl&#34;]
  * azurerm_key_vault_secret.eventhub_topic_secrets[&#34;00-aplfta-pub&#34;]
  * azurerm_key_vault_secret.eventhub_topic_secrets[&#34;00-apluta-ack&#34;]
  * azurerm_key_vault_secret.eventhub_topic_secrets[&#34;00-apluta-dl&#34;]
  * azurerm_key_vault_secret.eventhub_topic_secrets[&#34;00-apluta-pub&#34;]
  * azurerm_key_vault_secret.eventhub_topic_secrets[&#34;00-bl-ack&#34;]
  * azurerm_key_vault_secret.eventhub_topic_secrets[&#34;00-bl-dl&#34;]
  * azurerm_key_vault_secret.eventhub_topic_secrets[&#34;00-bl-pub&#34;]
  * azurerm_key_vault_secret.eventhub_topic_secrets[&#34;00-joh-ack&#34;]
  * azurerm_key_vault_secret.eventhub_topic_secrets[&#34;00-joh-dl&#34;]
  * azurerm_key_vault_secret.eventhub_topic_secrets[&#34;00-joh-pub&#34;]
  * azurerm_key_vault_secret.eventhub_topic_secrets[&#34;00-sbl-ack&#34;]
  * azurerm_key_vault_secret.eventhub_topic_secrets[&#34;00-sbl-dl&#34;]
  * azurerm_key_vault_secret.eventhub_topic_secrets[&#34;00-sbl-pub&#34;]
  * azurerm_key_vault_secret.eventhub_topic_secrets[&#34;00-td-ack&#34;]
  * azurerm_key_vault_secret.eventhub_topic_secrets[&#34;00-td-dl&#34;]
  * azurerm_key_vault_secret.eventhub_topic_secrets[&#34;00-td-pub&#34;]
  * azurerm_key_vault_secret.lz[&#34;00&#34;]
  * azurerm_key_vault_secret.tenant_id[&#34;00&#34;]
  * azurerm_role_assignment.rbac_owner[&#34;00-curated&#34;]
  * azurerm_role_assignment.rbac_owner[&#34;00-external&#34;]
  * azurerm_role_assignment.rbac_owner[&#34;00-landing&#34;]
  * azurerm_role_assignment.rbac_owner[&#34;00-xcutting&#34;]
  * azurerm_role_assignment.rbac_write[&#34;00-curated&#34;]
  * azurerm_role_assignment.rbac_write[&#34;00-external&#34;]
  * azurerm_role_assignment.rbac_write[&#34;00-landing&#34;]
  * azurerm_role_assignment.rbac_write[&#34;00-xcutting&#34;]
  * azurerm_storage_account.example[&#34;00-af-aplfpa&#34;]
  * azurerm_storage_account.example[&#34;00-af-aplfta&#34;]
  * azurerm_storage_account.example[&#34;00-af-apluta&#34;]
  * azurerm_storage_account.example[&#34;00-af-bails&#34;]
  * azurerm_storage_account.example[&#34;00-af-joh&#34;]
  * azurerm_storage_account.example[&#34;00-af-sbails&#34;]
  * azurerm_storage_account.example[&#34;00-af-td&#34;]
  * azurerm_storage_blob.config_json[&#34;00&#34;]
  * azurerm_storage_container.curated_extra[&#34;00-bronze&#34;]
  * azurerm_storage_container.curated_extra[&#34;00-gold&#34;]
  * azurerm_storage_container.curated_extra[&#34;00-silver&#34;]
  * azurerm_storage_container.xcutting[&#34;00-db-ack-checkpoint&#34;]
  * azurerm_storage_container.xcutting[&#34;00-db-rsp-checkpoint&#34;]
  * databricks_dbfs_file.config_file_stg00[0]
  * databricks_secret_scope.kv-scope-stg00[0]
  * local_file.config[&#34;00&#34;]




<details><summary>Change Result (Click me)</summary>

```hcl

  # azurerm_eventhub.aria_topic["00-aplfpa-ack"] will be created
  + resource "azurerm_eventhub" "aria_topic" {
      + id                  = (known after apply)
      + message_retention   = 1
      + name                = "evh-aplfpa-ack-00-uks-dlrm-01"
      + namespace_id        = (known after apply)
      + namespace_name      = "ingest00-integration-eventHubNamespace001-stg"
      + partition_count     = 2
      + partition_ids       = (known after apply)
      + resource_group_name = "ingest00-main-stg"
      + status              = "Active"
    }

  # azurerm_eventhub.aria_topic["00-aplfpa-dl"] will be created
  + resource "azurerm_eventhub" "aria_topic" {
      + id                  = (known after apply)
      + message_retention   = 1
      + name                = "evh-aplfpa-dl-00-uks-dlrm-01"
      + namespace_id        = (known after apply)
      + namespace_name      = "ingest00-integration-eventHubNamespace001-stg"
      + partition_count     = 2
      + partition_ids       = (known after apply)
      + resource_group_name = "ingest00-main-stg"
      + status              = "Active"
    }

  # azurerm_eventhub.aria_topic["00-aplfpa-pub"] will be created
  + resource "azurerm_eventhub" "aria_topic" {
      + id                  = (known after apply)
      + message_retention   = 1
      + name                = "evh-aplfpa-pub-00-uks-dlrm-01"
      + namespace_id        = (known after apply)
      + namespace_name      = "ingest00-integration-eventHubNamespace001-stg"
      + partition_count     = 2
      + partition_ids       = (known after apply)
      + resource_group_name = "ingest00-main-stg"
      + status              = "Active"
    }

  # azurerm_eventhub.aria_topic["00-aplfta-ack"] will be created
  + resource "azurerm_eventhub" "aria_topic" {
      + id                  = (known after apply)
      + message_retention   = 1
      + name                = "evh-aplfta-ack-00-uks-dlrm-01"
      + namespace_id        = (known after apply)
      + namespace_name      = "ingest00-integration-eventHubNamespace001-stg"
      + partition_count     = 2
      + partition_ids       = (known after apply)
      + resource_group_name = "ingest00-main-stg"
      + status              = "Active"
    }

  # azurerm_eventhub.aria_topic["00-aplfta-dl"] will be created
  + resource "azurerm_eventhub" "aria_topic" {
      + id                  = (known after apply)
      + message_retention   = 1
      + name                = "evh-aplfta-dl-00-uks-dlrm-01"
      + namespace_id        = (known after apply)
      + namespace_name      = "ingest00-integration-eventHubNamespace001-stg"
      + partition_count     = 2
      + partition_ids       = (known after apply)
      + resource_group_name = "ingest00-main-stg"
      + status              = "Active"
    }

  # azurerm_eventhub.aria_topic["00-aplfta-pub"] will be created
  + resource "azurerm_eventhub" "aria_topic" {
      + id                  = (known after apply)
      + message_retention   = 1
      + name                = "evh-aplfta-pub-00-uks-dlrm-01"
      + namespace_id        = (known after apply)
      + namespace_name      = "ingest00-integration-eventHubNamespace001-stg"
      + partition_count     = 2
      + partition_ids       = (known after apply)
      + resource_group_name = "ingest00-main-stg"
      + status              = "Active"
    }

  # azurerm_eventhub.aria_topic["00-apluta-ack"] will be created
  + resource "azurerm_eventhub" "aria_topic" {
      + id                  = (known after apply)
      + message_retention   = 1
      + name                = "evh-apluta-ack-00-uks-dlrm-01"
      + namespace_id        = (known after apply)
      + namespace_name      = "ingest00-integration-eventHubNamespace001-stg"
      + partition_count     = 2
      + partition_ids       = (known after apply)
      + resource_group_name = "ingest00-main-stg"
      + status              = "Active"
    }

  # azurerm_eventhub.aria_topic["00-apluta-dl"] will be created
  + resource "azurerm_eventhub" "aria_topic" {
      + id                  = (known after apply)
      + message_retention   = 1
      + name                = "evh-apluta-dl-00-uks-dlrm-01"
      + namespace_id        = (known after apply)
      + namespace_name      = "ingest00-integration-eventHubNamespace001-stg"
      + partition_count     = 2
      + partition_ids       = (known after apply)
      + resource_group_name = "ingest00-main-stg"
      + status              = "Active"
    }

  # azurerm_eventhub.aria_topic["00-apluta-pub"] will be created
  + resource "azurerm_eventhub" "aria_topic" {
      + id                  = (known after apply)
      + message_retention   = 1
      + name                = "evh-apluta-pub-00-uks-dlrm-01"
      + namespace_id        = (known after apply)
      + namespace_name      = "ingest00-integration-eventHubNamespace001-stg"
      + partition_count     = 2
      + partition_ids       = (known after apply)
      + resource_group_name = "ingest00-main-stg"
      + status              = "Active"
    }

  # azurerm_eventhub.aria_topic["00-bl-ack"] will be created
  + resource "azurerm_eventhub" "aria_topic" {
      + id                  = (known after apply)
      + message_retention   = 1
      + name                = "evh-bl-ack-00-uks-dlrm-01"
      + namespace_id        = (known after apply)
      + namespace_name      = "ingest00-integration-eventHubNamespace001-stg"
      + partition_count     = 2
      + partition_ids       = (known after apply)
      + resource_group_name = "ingest00-main-stg"
      + status              = "Active"
    }

  # azurerm_eventhub.aria_topic["00-bl-dl"] will be created
  + resource "azurerm_eventhub" "aria_topic" {
      + id                  = (known after apply)
      + message_retention   = 1
      + name                = "evh-bl-dl-00-uks-dlrm-01"
      + namespace_id        = (known after apply)
      + namespace_name      = "ingest00-integration-eventHubNamespace001-stg"
      + partition_count     = 2
      + partition_ids       = (known after apply)
      + resource_group_name = "ingest00-main-stg"
      + status              = "Active"
    }

  # azurerm_eventhub.aria_topic["00-bl-pub"] will be created
  + resource "azurerm_eventhub" "aria_topic" {
      + id                  = (known after apply)
      + message_retention   = 1
      + name                = "evh-bl-pub-00-uks-dlrm-01"
      + namespace_id        = (known after apply)
      + namespace_name      = "ingest00-integration-eventHubNamespace001-stg"
      + partition_count     = 2
      + partition_ids       = (known after apply)
      + resource_group_name = "ingest00-main-stg"
      + status              = "Active"
    }

  # azurerm_eventhub.aria_topic["00-joh-ack"] will be created
  + resource "azurerm_eventhub" "aria_topic" {
      + id                  = (known after apply)
      + message_retention   = 1
      + name                = "evh-joh-ack-00-uks-dlrm-01"
      + namespace_id        = (known after apply)
      + namespace_name      = "ingest00-integration-eventHubNamespace001-stg"
      + partition_count     = 2
      + partition_ids       = (known after apply)
      + resource_group_name = "ingest00-main-stg"
      + status              = "Active"
    }

  # azurerm_eventhub.aria_topic["00-joh-dl"] will be created
  + resource "azurerm_eventhub" "aria_topic" {
      + id                  = (known after apply)
      + message_retention   = 1
      + name                = "evh-joh-dl-00-uks-dlrm-01"
      + namespace_id        = (known after apply)
      + namespace_name      = "ingest00-integration-eventHubNamespace001-stg"
      + partition_count     = 2
      + partition_ids       = (known after apply)
      + resource_group_name = "ingest00-main-stg"
      + status              = "Active"
    }

  # azurerm_eventhub.aria_topic["00-joh-pub"] will be created
  + resource "azurerm_eventhub" "aria_topic" {
      + id                  = (known after apply)
      + message_retention   = 1
      + name                = "evh-joh-pub-00-uks-dlrm-01"
      + namespace_id        = (known after apply)
      + namespace_name      = "ingest00-integration-eventHubNamespace001-stg"
      + partition_count     = 2
      + partition_ids       = (known after apply)
      + resource_group_name = "ingest00-main-stg"
      + status              = "Active"
    }

  # azurerm_eventhub.aria_topic["00-sbl-ack"] will be created
  + resource "azurerm_eventhub" "aria_topic" {
      + id                  = (known after apply)
      + message_retention   = 1
      + name                = "evh-sbl-ack-00-uks-dlrm-01"
      + namespace_id        = (known after apply)
      + namespace_name      = "ingest00-integration-eventHubNamespace001-stg"
      + partition_count     = 2
      + partition_ids       = (known after apply)
      + resource_group_name = "ingest00-main-stg"
      + status              = "Active"
    }

  # azurerm_eventhub.aria_topic["00-sbl-dl"] will be created
  + resource "azurerm_eventhub" "aria_topic" {
      + id                  = (known after apply)
      + message_retention   = 1
      + name                = "evh-sbl-dl-00-uks-dlrm-01"
      + namespace_id        = (known after apply)
      + namespace_name      = "ingest00-integration-eventHubNamespace001-stg"
      + partition_count     = 2
      + partition_ids       = (known after apply)
      + resource_group_name = "ingest00-main-stg"
      + status              = "Active"
    }

  # azurerm_eventhub.aria_topic["00-sbl-pub"] will be created
  + resource "azurerm_eventhub" "aria_topic" {
      + id                  = (known after apply)
      + message_retention   = 1
      + name                = "evh-sbl-pub-00-uks-dlrm-01"
      + namespace_id        = (known after apply)
      + namespace_name      = "ingest00-integration-eventHubNamespace001-stg"
      + partition_count     = 2
      + partition_ids       = (known after apply)
      + resource_group_name = "ingest00-main-stg"
      + status              = "Active"
    }

  # azurerm_eventhub.aria_topic["00-td-ack"] will be created
  + resource "azurerm_eventhub" "aria_topic" {
      + id                  = (known after apply)
      + message_retention   = 1
      + name                = "evh-td-ack-00-uks-dlrm-01"
      + namespace_id        = (known after apply)
      + namespace_name      = "ingest00-integration-eventHubNamespace001-stg"
      + partition_count     = 2
      + partition_ids       = (known after apply)
      + resource_group_name = "ingest00-main-stg"
      + status              = "Active"
    }

  # azurerm_eventhub.aria_topic["00-td-dl"] will be created
  + resource "azurerm_eventhub" "aria_topic" {
      + id                  = (known after apply)
      + message_retention   = 1
      + name                = "evh-td-dl-00-uks-dlrm-01"
      + namespace_id        = (known after apply)
      + namespace_name      = "ingest00-integration-eventHubNamespace001-stg"
      + partition_count     = 2
      + partition_ids       = (known after apply)
      + resource_group_name = "ingest00-main-stg"
      + status              = "Active"
    }

  # azurerm_eventhub.aria_topic["00-td-pub"] will be created
  + resource "azurerm_eventhub" "aria_topic" {
      + id                  = (known after apply)
      + message_retention   = 1
      + name                = "evh-td-pub-00-uks-dlrm-01"
      + namespace_id        = (known after apply)
      + namespace_name      = "ingest00-integration-eventHubNamespace001-stg"
      + partition_count     = 2
      + partition_ids       = (known after apply)
      + resource_group_name = "ingest00-main-stg"
      + status              = "Active"
    }

  # azurerm_eventhub_authorization_rule.aria_topic_sas["00-aplfpa-ack"] will be created
  + resource "azurerm_eventhub_authorization_rule" "aria_topic_sas" {
      + eventhub_name                     = "evh-aplfpa-ack-00-uks-dlrm-01"
      + id                                = (known after apply)
      + listen                            = true
      + manage                            = true
      + name                              = "aria_manage_sas"
      + namespace_name                    = "ingest00-integration-eventHubNamespace001-stg"
      + primary_connection_string         = (sensitive value)
      + primary_connection_string_alias   = (sensitive value)
      + primary_key                       = (sensitive value)
      + resource_group_name               = "ingest00-main-stg"
      + secondary_connection_string       = (sensitive value)
      + secondary_connection_string_alias = (sensitive value)
      + secondary_key                     = (sensitive value)
      + send                              = true
    }

  # azurerm_eventhub_authorization_rule.aria_topic_sas["00-aplfpa-dl"] will be created
  + resource "azurerm_eventhub_authorization_rule" "aria_topic_sas" {
      + eventhub_name                     = "evh-aplfpa-dl-00-uks-dlrm-01"
      + id                                = (known after apply)
      + listen                            = true
      + manage                            = true
      + name                              = "aria_manage_sas"
      + namespace_name                    = "ingest00-integration-eventHubNamespace001-stg"
      + primary_connection_string         = (sensitive value)
      + primary_connection_string_alias   = (sensitive value)
      + primary_key                       = (sensitive value)
      + resource_group_name               = "ingest00-main-stg"
      + secondary_connection_string       = (sensitive value)
      + secondary_connection_string_alias = (sensitive value)
      + secondary_key                     = (sensitive value)
      + send                              = true
    }

  # azurerm_eventhub_authorization_rule.aria_topic_sas["00-aplfpa-pub"] will be created
  + resource "azurerm_eventhub_authorization_rule" "aria_topic_sas" {
      + eventhub_name                     = "evh-aplfpa-pub-00-uks-dlrm-01"
      + id                                = (known after apply)
      + listen                            = true
      + manage                            = true
      + name                              = "aria_manage_sas"
      + namespace_name                    = "ingest00-integration-eventHubNamespace001-stg"
      + primary_connection_string         = (sensitive value)
      + primary_connection_string_alias   = (sensitive value)
      + primary_key                       = (sensitive value)
      + resource_group_name               = "ingest00-main-stg"
      + secondary_connection_string       = (sensitive value)
      + secondary_connection_string_alias = (sensitive value)
      + secondary_key                     = (sensitive value)
      + send                              = true
    }

  # azurerm_eventhub_authorization_rule.aria_topic_sas["00-aplfta-ack"] will be created
  + resource "azurerm_eventhub_authorization_rule" "aria_topic_sas" {
      + eventhub_name                     = "evh-aplfta-ack-00-uks-dlrm-01"
      + id                                = (known after apply)
      + listen                            = true
      + manage                            = true
      + name                              = "aria_manage_sas"
      + namespace_name                    = "ingest00-integration-eventHubNamespace001-stg"
      + primary_connection_string         = (sensitive value)
      + primary_connection_string_alias   = (sensitive value)
      + primary_key                       = (sensitive value)
      + resource_group_name               = "ingest00-main-stg"
      + secondary_connection_string       = (sensitive value)
      + secondary_connection_string_alias = (sensitive value)
      + secondary_key                     = (sensitive value)
      + send                              = true
    }

  # azurerm_eventhub_authorization_rule.aria_topic_sas["00-aplfta-dl"] will be created
  + resource "azurerm_eventhub_authorization_rule" "aria_topic_sas" {
      + eventhub_name                     = "evh-aplfta-dl-00-uks-dlrm-01"
      + id                                = (known after apply)
      + listen                            = true
      + manage                            = true
      + name                              = "aria_manage_sas"
      + namespace_name                    = "ingest00-integration-eventHubNamespace001-stg"
      + primary_connection_string         = (sensitive value)
      + primary_connection_string_alias   = (sensitive value)
      + primary_key                       = (sensitive value)
      + resource_group_name               = "ingest00-main-stg"
      + secondary_connection_string       = (sensitive value)
      + secondary_connection_string_alias = (sensitive value)
      + secondary_key                     = (sensitive value)
      + send                              = true
    }

  # azurerm_eventhub_authorization_rule.aria_topic_sas["00-aplfta-pub"] will be created
  + resource "azurerm_eventhub_authorization_rule" "aria_topic_sas" {
      + eventhub_name                     = "evh-aplfta-pub-00-uks-dlrm-01"
      + id                                = (known after apply)
      + listen                            = true
      + manage                            = true
      + name                              = "aria_manage_sas"
      + namespace_name                    = "ingest00-integration-eventHubNamespace001-stg"
      + primary_connection_string         = (sensitive value)
      + primary_connection_string_alias   = (sensitive value)
      + primary_key                       = (sensitive value)
      + resource_group_name               = "ingest00-main-stg"
      + secondary_connection_string       = (sensitive value)
      + secondary_connection_string_alias = (sensitive value)
      + secondary_key                     = (sensitive value)
      + send                              = true
    }

  # azurerm_eventhub_authorization_rule.aria_topic_sas["00-apluta-ack"] will be created
  + resource "azurerm_eventhub_authorization_rule" "aria_topic_sas" {
      + eventhub_name                     = "evh-apluta-ack-00-uks-dlrm-01"
      + id                                = (known after apply)
      + listen                            = true
      + manage                            = true
      + name                              = "aria_manage_sas"
      + namespace_name                    = "ingest00-integration-eventHubNamespace001-stg"
      + primary_connection_string         = (sensitive value)
      + primary_connection_string_alias   = (sensitive value)
      + primary_key                       = (sensitive value)
      + resource_group_name               = "ingest00-main-stg"
      + secondary_connection_string       = (sensitive value)
      + secondary_connection_string_alias = (sensitive value)
      + secondary_key                     = (sensitive value)
      + send                              = true
    }

  # azurerm_eventhub_authorization_rule.aria_topic_sas["00-apluta-dl"] will be created
  + resource "azurerm_eventhub_authorization_rule" "aria_topic_sas" {
      + eventhub_name                     = "evh-apluta-dl-00-uks-dlrm-01"
      + id                                = (known after apply)
      + listen                            = true
      + manage                            = true
      + name                              = "aria_manage_sas"
      + namespace_name                    = "ingest00-integration-eventHubNamespace001-stg"
      + primary_connection_string         = (sensitive value)
      + primary_connection_string_alias   = (sensitive value)
      + primary_key                       = (sensitive value)
      + resource_group_name               = "ingest00-main-stg"
      + secondary_connection_string       = (sensitive value)
      + secondary_connection_string_alias = (sensitive value)
      + secondary_key                     = (sensitive value)
      + send         

# ...
# ... The maximum length of GitHub Comment is 65536, so the content is omitted by tfcmt.
# ...

perties (known after apply)

      + routing (known after apply)

      + share_properties (known after apply)

      + static_website (known after apply)
    }

  # azurerm_storage_account.example["00-af-sbails"] will be created
  + resource "azurerm_storage_account" "example" {
      + access_tier                        = (known after apply)
      + account_kind                       = "StorageV2"
      + account_replication_type           = "LRS"
      + account_tier                       = "Standard"
      + allow_nested_items_to_be_public    = true
      + cross_tenant_replication_enabled   = false
      + default_to_oauth_authentication    = false
      + dns_endpoint_type                  = "Standard"
      + https_traffic_only_enabled         = true
      + id                                 = (known after apply)
      + infrastructure_encryption_enabled  = false
      + is_hns_enabled                     = false
      + large_file_share_enabled           = (known after apply)
      + local_user_enabled                 = true
      + location                           = "uksouth"
      + min_tls_version                    = "TLS1_2"
      + name                               = "afsbailsstg00uksdlrm01"
      + nfsv3_enabled                      = false
      + primary_access_key                 = (sensitive value)
      + primary_blob_connection_string     = (sensitive value)
      + primary_blob_endpoint              = (known after apply)
      + primary_blob_host                  = (known after apply)
      + primary_blob_internet_endpoint     = (known after apply)
      + primary_blob_internet_host         = (known after apply)
      + primary_blob_microsoft_endpoint    = (known after apply)
      + primary_blob_microsoft_host        = (known after apply)
      + primary_connection_string          = (sensitive value)
      + primary_dfs_endpoint               = (known after apply)
      + primary_dfs_host                   = (known after apply)
      + primary_dfs_internet_endpoint      = (known after apply)
      + primary_dfs_internet_host          = (known after apply)
      + primary_dfs_microsoft_endpoint     = (known after apply)
      + primary_dfs_microsoft_host         = (known after apply)
      + primary_file_endpoint              = (known after apply)
      + primary_file_host                  = (known after apply)
      + primary_file_internet_endpoint     = (known after apply)
      + primary_file_internet_host         = (known after apply)
      + primary_file_microsoft_endpoint    = (known after apply)
      + primary_file_microsoft_host        = (known after apply)
      + primary_location                   = (known after apply)
      + primary_queue_endpoint             = (known after apply)
      + primary_queue_host                 = (known after apply)
      + primary_queue_microsoft_endpoint   = (known after apply)
      + primary_queue_microsoft_host       = (known after apply)
      + primary_table_endpoint             = (known after apply)
      + primary_table_host                 = (known after apply)
      + primary_table_microsoft_endpoint   = (known after apply)
      + primary_table_microsoft_host       = (known after apply)
      + primary_web_endpoint               = (known after apply)
      + primary_web_host                   = (known after apply)
      + primary_web_internet_endpoint      = (known after apply)
      + primary_web_internet_host          = (known after apply)
      + primary_web_microsoft_endpoint     = (known after apply)
      + primary_web_microsoft_host         = (known after apply)
      + public_network_access_enabled      = true
      + queue_encryption_key_type          = "Service"
      + resource_group_name                = "ingest00-main-stg"
      + secondary_access_key               = (sensitive value)
      + secondary_blob_connection_string   = (sensitive value)
      + secondary_blob_endpoint            = (known after apply)
      + secondary_blob_host                = (known after apply)
      + secondary_blob_internet_endpoint   = (known after apply)
      + secondary_blob_internet_host       = (known after apply)
      + secondary_blob_microsoft_endpoint  = (known after apply)
      + secondary_blob_microsoft_host      = (known after apply)
      + secondary_connection_string        = (sensitive value)
      + secondary_dfs_endpoint             = (known after apply)
      + secondary_dfs_host                 = (known after apply)
      + secondary_dfs_internet_endpoint    = (known after apply)
      + secondary_dfs_internet_host        = (known after apply)
      + secondary_dfs_microsoft_endpoint   = (known after apply)
      + secondary_dfs_microsoft_host       = (known after apply)
      + secondary_file_endpoint            = (known after apply)
      + secondary_file_host                = (known after apply)
      + secondary_file_internet_endpoint   = (known after apply)
      + secondary_file_internet_host       = (known after apply)
      + secondary_file_microsoft_endpoint  = (known after apply)
      + secondary_file_microsoft_host      = (known after apply)
      + secondary_location                 = (known after apply)
      + secondary_queue_endpoint           = (known after apply)
      + secondary_queue_host               = (known after apply)
      + secondary_queue_microsoft_endpoint = (known after apply)
      + secondary_queue_microsoft_host     = (known after apply)
      + secondary_table_endpoint           = (known after apply)
      + secondary_table_host               = (known after apply)
      + secondary_table_microsoft_endpoint = (known after apply)
      + secondary_table_microsoft_host     = (known after apply)
      + secondary_web_endpoint             = (known after apply)
      + secondary_web_host                 = (known after apply)
      + secondary_web_internet_endpoint    = (known after apply)
      + secondary_web_internet_host        = (known after apply)
      + secondary_web_microsoft_endpoint   = (known after apply)
      + secondary_web_microsoft_host       = (known after apply)
      + sftp_enabled                       = false
      + shared_access_key_enabled          = true
      + table_encryption_key_type          = "Service"
      + tags                               = {
          + "application"  = "dlrm-data-ingest"
          + "builtFrom"    = "hmcts/dlrm-data-ingest-aria"
          + "businessArea" = "cross-cutting"
          + "criticality"  = "High"
          + "environment"  = "staging"
        }

      + blob_properties (known after apply)

      + network_rules (known after apply)

      + queue_properties (known after apply)

      + routing (known after apply)

      + share_properties (known after apply)

      + static_website (known after apply)
    }

  # azurerm_storage_account.example["00-af-td"] will be created
  + resource "azurerm_storage_account" "example" {
      + access_tier                        = (known after apply)
      + account_kind                       = "StorageV2"
      + account_replication_type           = "LRS"
      + account_tier                       = "Standard"
      + allow_nested_items_to_be_public    = true
      + cross_tenant_replication_enabled   = false
      + default_to_oauth_authentication    = false
      + dns_endpoint_type                  = "Standard"
      + https_traffic_only_enabled         = true
      + id                                 = (known after apply)
      + infrastructure_encryption_enabled  = false
      + is_hns_enabled                     = false
      + large_file_share_enabled           = (known after apply)
      + local_user_enabled                 = true
      + location                           = "uksouth"
      + min_tls_version                    = "TLS1_2"
      + name                               = "aftdstg00uksdlrm01"
      + nfsv3_enabled                      = false
      + primary_access_key                 = (sensitive value)
      + primary_blob_connection_string     = (sensitive value)
      + primary_blob_endpoint              = (known after apply)
      + primary_blob_host                  = (known after apply)
      + primary_blob_internet_endpoint     = (known after apply)
      + primary_blob_internet_host         = (known after apply)
      + primary_blob_microsoft_endpoint    = (known after apply)
      + primary_blob_microsoft_host        = (known after apply)
      + primary_connection_string          = (sensitive value)
      + primary_dfs_endpoint               = (known after apply)
      + primary_dfs_host                   = (known after apply)
      + primary_dfs_internet_endpoint      = (known after apply)
      + primary_dfs_internet_host          = (known after apply)
      + primary_dfs_microsoft_endpoint     = (known after apply)
      + primary_dfs_microsoft_host         = (known after apply)
      + primary_file_endpoint              = (known after apply)
      + primary_file_host                  = (known after apply)
      + primary_file_internet_endpoint     = (known after apply)
      + primary_file_internet_host         = (known after apply)
      + primary_file_microsoft_endpoint    = (known after apply)
      + primary_file_microsoft_host        = (known after apply)
      + primary_location                   = (known after apply)
      + primary_queue_endpoint             = (known after apply)
      + primary_queue_host                 = (known after apply)
      + primary_queue_microsoft_endpoint   = (known after apply)
      + primary_queue_microsoft_host       = (known after apply)
      + primary_table_endpoint             = (known after apply)
      + primary_table_host                 = (known after apply)
      + primary_table_microsoft_endpoint   = (known after apply)
      + primary_table_microsoft_host       = (known after apply)
      + primary_web_endpoint               = (known after apply)
      + primary_web_host                   = (known after apply)
      + primary_web_internet_endpoint      = (known after apply)
      + primary_web_internet_host          = (known after apply)
      + primary_web_microsoft_endpoint     = (known after apply)
      + primary_web_microsoft_host         = (known after apply)
      + public_network_access_enabled      = true
      + queue_encryption_key_type          = "Service"
      + resource_group_name                = "ingest00-main-stg"
      + secondary_access_key               = (sensitive value)
      + secondary_blob_connection_string   = (sensitive value)
      + secondary_blob_endpoint            = (known after apply)
      + secondary_blob_host                = (known after apply)
      + secondary_blob_internet_endpoint   = (known after apply)
      + secondary_blob_internet_host       = (known after apply)
      + secondary_blob_microsoft_endpoint  = (known after apply)
      + secondary_blob_microsoft_host      = (known after apply)
      + secondary_connection_string        = (sensitive value)
      + secondary_dfs_endpoint             = (known after apply)
      + secondary_dfs_host                 = (known after apply)
      + secondary_dfs_internet_endpoint    = (known after apply)
      + secondary_dfs_internet_host        = (known after apply)
      + secondary_dfs_microsoft_endpoint   = (known after apply)
      + secondary_dfs_microsoft_host       = (known after apply)
      + secondary_file_endpoint            = (known after apply)
      + secondary_file_host                = (known after apply)
      + secondary_file_internet_endpoint   = (known after apply)
      + secondary_file_internet_host       = (known after apply)
      + secondary_file_microsoft_endpoint  = (known after apply)
      + secondary_file_microsoft_host      = (known after apply)
      + secondary_location                 = (known after apply)
      + secondary_queue_endpoint           = (known after apply)
      + secondary_queue_host               = (known after apply)
      + secondary_queue_microsoft_endpoint = (known after apply)
      + secondary_queue_microsoft_host     = (known after apply)
      + secondary_table_endpoint           = (known after apply)
      + secondary_table_host               = (known after apply)
      + secondary_table_microsoft_endpoint = (known after apply)
      + secondary_table_microsoft_host     = (known after apply)
      + secondary_web_endpoint             = (known after apply)
      + secondary_web_host                 = (known after apply)
      + secondary_web_internet_endpoint    = (known after apply)
      + secondary_web_internet_host        = (known after apply)
      + secondary_web_microsoft_endpoint   = (known after apply)
      + secondary_web_microsoft_host       = (known after apply)
      + sftp_enabled                       = false
      + shared_access_key_enabled          = true
      + table_encryption_key_type          = "Service"
      + tags                               = {
          + "application"  = "dlrm-data-ingest"
          + "builtFrom"    = "hmcts/dlrm-data-ingest-aria"
          + "businessArea" = "cross-cutting"
          + "criticality"  = "High"
          + "environment"  = "staging"
        }

      + blob_properties (known after apply)

      + network_rules (known after apply)

      + queue_properties (known after apply)

      + routing (known after apply)

      + share_properties (known after apply)

      + static_website (known after apply)
    }

  # azurerm_storage_blob.config_json["00"] will be created
  + resource "azurerm_storage_blob" "config_json" {
      + access_tier            = (known after apply)
      + content_type           = "application/octet-stream"
      + id                     = (known after apply)
      + metadata               = (known after apply)
      + name                   = "configs/env_config.json"
      + parallelism            = 8
      + size                   = 0
      + source                 = "./tmp/config_stg_00.json"
      + storage_account_name   = "ingest00curatedstg"
      + storage_container_name = "bronze"
      + type                   = "Block"
      + url                    = (known after apply)
    }

  # azurerm_storage_container.curated_extra["00-bronze"] will be created
  + resource "azurerm_storage_container" "curated_extra" {
      + container_access_type             = "private"
      + default_encryption_scope          = (known after apply)
      + encryption_scope_override_enabled = true
      + has_immutability_policy           = (known after apply)
      + has_legal_hold                    = (known after apply)
      + id                                = (known after apply)
      + metadata                          = (known after apply)
      + name                              = "bronze"
      + resource_manager_id               = (known after apply)
      + storage_account_name              = "ingest00curatedstg"
    }

  # azurerm_storage_container.curated_extra["00-gold"] will be created
  + resource "azurerm_storage_container" "curated_extra" {
      + container_access_type             = "private"
      + default_encryption_scope          = (known after apply)
      + encryption_scope_override_enabled = true
      + has_immutability_policy           = (known after apply)
      + has_legal_hold                    = (known after apply)
      + id                                = (known after apply)
      + metadata                          = (known after apply)
      + name                              = "gold"
      + resource_manager_id               = (known after apply)
      + storage_account_name              = "ingest00curatedstg"
    }

  # azurerm_storage_container.curated_extra["00-silver"] will be created
  + resource "azurerm_storage_container" "curated_extra" {
      + container_access_type             = "private"
      + default_encryption_scope          = (known after apply)
      + encryption_scope_override_enabled = true
      + has_immutability_policy           = (known after apply)
      + has_legal_hold                    = (known after apply)
      + id                                = (known after apply)
      + metadata                          = (known after apply)
      + name                              = "silver"
      + resource_manager_id               = (known after apply)
      + storage_account_name              = "ingest00curatedstg"
    }

  # azurerm_storage_container.xcutting["00-db-ack-checkpoint"] will be created
  + resource "azurerm_storage_container" "xcutting" {
      + container_access_type             = "private"
      + default_encryption_scope          = (known after apply)
      + encryption_scope_override_enabled = true
      + has_immutability_policy           = (known after apply)
      + has_legal_hold                    = (known after apply)
      + id                                = (known after apply)
      + metadata                          = (known after apply)
      + name                              = "db-ack-checkpoint"
      + resource_manager_id               = (known after apply)
      + storage_account_name              = "ingest00xcuttingstg"
    }

  # azurerm_storage_container.xcutting["00-db-rsp-checkpoint"] will be created
  + resource "azurerm_storage_container" "xcutting" {
      + container_access_type             = "private"
      + default_encryption_scope          = (known after apply)
      + encryption_scope_override_enabled = true
      + has_immutability_policy           = (known after apply)
      + has_legal_hold                    = (known after apply)
      + id                                = (known after apply)
      + metadata                          = (known after apply)
      + name                              = "db-rsp-checkpoint"
      + resource_manager_id               = (known after apply)
      + storage_account_name              = "ingest00xcuttingstg"
    }

  # databricks_dbfs_file.config_file_stg00[0] will be created
  + resource "databricks_dbfs_file" "config_file_stg00" {
      + content_base64 = "ewogICAgImVudiI6ICJzdGciLAogICAgImx6X2tleSI6ICIwMCIKfQ=="
      + dbfs_path      = (known after apply)
      + file_size      = (known after apply)
      + id             = (known after apply)
      + md5            = "different"
      + path           = "/configs/config.json"
    }

  # databricks_secret_scope.kv-scope-stg00[0] will be created
  + resource "databricks_secret_scope" "kv-scope-stg00" {
      + backend_type = (known after apply)
      + id           = (known after apply)
      + name         = "ingest00-meta002-stg"

      + keyvault_metadata {
          + dns_name    = "https://ingest00-meta002-stg.vault.azure.net/"
          + resource_id = "/subscriptions/da8a21e5-d260-4162-9391-6bdadf9103f8/resourceGroups/ingest00-main-stg/providers/Microsoft.KeyVault/vaults/ingest00-meta002-stg"
        }
    }

  # local_file.config["00"] will be created
  + resource "local_file" "config" {
      + content              = jsonencode(
            {
              + env = "stg"
              + lz  = "00"
            }
        )
      + content_base64sha256 = (known after apply)
      + content_base64sha512 = (known after apply)
      + content_md5          = (known after apply)
      + content_sha1         = (known after apply)
      + content_sha256       = (known after apply)
      + content_sha512       = (known after apply)
      + directory_permission = "0777"
      + file_permission      = "0777"
      + filename             = "./tmp/config_stg_00.json"
      + id                   = (known after apply)
    }

Plan: 94 to add, 0 to change, 0 to destroy.

Changes to Outputs:
  + eventhub_sas_keys = (sensitive value)
  + workspace_host    = {
      + stg-00 = {
          + name                = "ingest00-product-databricks001-stg"
          + resource_group_name = "ingest00-main-stg"
          + ws_rl               = "adb-4305432441461530.10.azuredatabricks.net"
        }
    }
```

</details>





## :warning: Errors

* add a label 1112: stg_aria - Terraform Plan Apply/add-or-update: POST https://api.github.com/repos/hmcts/dlrm-data-ingest-aria/issues/104/labels: 422 Validation Failed [{Resource:Label Field:name Code:invalid Message:}]
<!-- github-comment: {"Command":"plan","PRNumber":104,"Program":"tfcmt","SHA1":"","Target":"1112: stg_aria - Terraform Plan Apply","Vars":{}} -->